src/Documents/ЗарплатаКВыплате/ЗарплатаКВыплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗарплатаКВыплате</name>
  <comment>(Упр)</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактерВыплаты</name>
    <type>
      <types>EnumRef.ХарактерВыплатыЗарплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Зарплата</name>
    <attributes>
      <name>Физлицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Авторасчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ФИОФизЛиц/ФИОФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизЛиц</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ВзаиморасчетыСРаботниками/ВзаиморасчетыСРаботниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСРаботниками</name>
  <comment>(Упр)</comment>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте упр. учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХарактерВыплаты</name>
    <type>
      <types>EnumRef.ХарактерВыплатыЗарплаты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/InformationRegisters/Работники/Работники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Работники</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаУвольнения</name>
    <type>
      <types>CatalogRef.ОснованияУвольнения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/АвансыРаботникам/АвансыРаботникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвансыРаботникам</name>
  <resources>
    <name>СуммаАванса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВыплаченностьЗарплаты/ВыплаченностьЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВыплаченностьЗарплаты</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>НеВыплачено</name>
  </enumValues>
  <enumValues>
    <name>Выплачено</name>
  </enumValues>
  <enumValues>
    <name>Задепонировано</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ХарактерВыплатыЗарплаты/ХарактерВыплатыЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХарактерВыплатыЗарплаты</name>
  <enumValues>
    <name>Зарплата</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
  <enumValues>
    <name>ПоБольничнымЛистам</name>
  </enumValues>
  <enumValues>
    <name>Отпускные</name>
  </enumValues>
  <enumValues>
    <name>Командировочные</name>
  </enumValues>
  <enumValues>
    <name>Премии</name>
  </enumValues>
  <enumValues>
    <name>РасчетПриУвольнении</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРазовыеНачисления</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ПричиныИзмененияСостояния/ПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныИзмененияСостояния</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПриемНаРаботу</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗарплатаКВыплате/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

// Формирует запрос по документу
//
// Параметры: 
//  Режим - режим проведения
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросДляПечати()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("НачалоМесяца",  НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("Ссылка",        Ссылка);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ФИОФизЛицСрезПоследних.Фамилия + "" "" + ФИОФизЛицСрезПоследних.Имя + "" "" + ФИОФизЛицСрезПоследних.Отчество, ЗарплатаКВыплатеЗарплата.Физлицо.Наименование) КАК ФизЛицо,
	|	ЗарплатаКВыплатеЗарплата.Сумма,
	|	ВзаиморасчетыДатаДокумента.СуммаУпрОстаток КАК СуммаНаДатуДокумента,
	|	ВзаиморасчетыНачалоМесяца.СуммаУпрОстаток КАК СуммаНаНачалоМесяца,
	|	ЗарплатаКВыплатеЗарплата.НомерСтроки КАК НомерПП
	|ИЗ
	|	Документ.ЗарплатаКВыплате.Зарплата КАК ЗарплатаКВыплатеЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(
	|		&ДатаДокумента,
	|		Физлицо В
	|		    (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		        ЗарплатаКВыплатеЗарплата.Физлицо
	|		    ИЗ
	|		        Документ.ЗарплатаКВыплате.Зарплата КАК ЗарплатаКВыплатеЗарплата
	|		    ГДЕ
	|		        ЗарплатаКВыплатеЗарплата.Ссылка = &Ссылка)) КАК ФИОФизЛицСрезПоследних
	|		ПО ЗарплатаКВыплатеЗарплата.Физлицо = ФИОФизЛицСрезПоследних.ФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботниками.Остатки(
	|		&НачалоМесяца,
	|		Физлицо В
	|		    (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		        ЗарплатаКВыплатеЗарплата.Физлицо
	|		    ИЗ
	|		        Документ.ЗарплатаКВыплате.Зарплата КАК ЗарплатаКВыплатеЗарплата
	|		    ГДЕ
	|		        ЗарплатаКВыплатеЗарплата.Ссылка = &Ссылка)) КАК ВзаиморасчетыНачалоМесяца
	|		ПО ЗарплатаКВыплатеЗарплата.Физлицо = ВзаиморасчетыНачалоМесяца.Физлицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботниками.Остатки(
	|		&ДатаДокумента,
	|		Физлицо В
	|		    (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		        ЗарплатаКВыплатеЗарплата.Физлицо
	|		    ИЗ
	|		        Документ.ЗарплатаКВыплате.Зарплата КАК ЗарплатаКВыплатеЗарплата
	|		    ГДЕ
	|		        ЗарплатаКВыплатеЗарплата.Ссылка = &Ссылка)) КАК ВзаиморасчетыДатаДокумента
	|		ПО ЗарплатаКВыплатеЗарплата.Физлицо = ВзаиморасчетыДатаДокумента.Физлицо
	|ГДЕ
	|	ЗарплатаКВыплатеЗарплата.Ссылка = &Ссылка";
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

Процедура Автозаполнение() Экспорт
	
	Зарплата.Очистить();
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("парамДата",					КонецМесяца(Дата) + 1);
	Запрос.УстановитьПараметр("парамНеВыплачено",			Перечисления.ВыплаченностьЗарплаты.НеВыплачено);
	Запрос.УстановитьПараметр("парамМесяц",					КонецМесяца(Дата));
	Если Не Подразделение.Пустая() Или ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Аванс Тогда
		Запрос.УстановитьПараметр("парамПодразделение",Подразделение);
	КонецЕсли;
	
	Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Аванс Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	РаботникиСрезПоследних.Физлицо,
		|	АвансыРаботникам.СуммаАванса КАК Сумма,
		|	Истина КАК Авторасчет
		|ИЗ
		|	РегистрСведений.Работники.СрезПоследних(&парамДата) КАК РаботникиСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АвансыРаботникам КАК АвансыРаботникам
		|		ПО РаботникиСрезПоследних.Физлицо = АвансыРаботникам.Физлицо
		|ГДЕ
		|	РаботникиСрезПоследних.ПричинаИзмененияСостояния <> &парамУволен" +
		?(Подразделение.Пустая(),"",Символы.ПС + " И РаботникиСрезПоследних.Подразделение = &парамПодразделение") + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	РаботникиСрезПоследних.Физлицо.Наименование"; 
		
		Запрос.УстановитьПараметр("парамУволен",	Перечисления.ПричиныИзмененияСостояния.Увольнение);
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());

	Иначе
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыСРаботникамиОстатки.Физлицо,
		|	0 КАК Сумма,
		|	Истина КАК Авторасчет
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСРаботниками.Остатки(
		|		&парамДата,) КАК ВзаиморасчетыСРаботникамиОстатки
		|ГДЕ
		|	ВзаиморасчетыСРаботникамиОстатки.СуммаУпрОстаток > 0";
		Если Не Подразделение.Пустая() Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И ВзаиморасчетыСРаботникамиОстатки.Физлицо В
			|		(ВЫБРАТЬ
			|			РаботникиСрезПоследних.ФизЛицо
			|		ИЗ
			|			РегистрСведений.Работники.СрезПоследних(&парамДата, ) КАК РаботникиСрезПоследних
			|		ГДЕ
			|			РаботникиСрезПоследних.Подразделение = &парамПодразделение)";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВзаиморасчетыСРаботникамиОстатки.Физлицо.Наименование";
		
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
		
	КонецЕсли;
		
КонецПроцедуры //  Автозаполнение

Процедура Рассчитать() Экспорт

	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("парамСсылка",		Ссылка);
	Запрос.УстановитьПараметр("парамДата",			КонецМесяца(Дата) + 1);
	Запрос.УстановитьПараметр("парамМесяц",			КонецМесяца(Дата));
	
	Если ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Аванс Тогда 
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗарплатаКВыплатеЗарплата.НомерСтроки КАК НомерСтроки,
		|	ЗарплатаКВыплатеЗарплата.Физлицо,
		|	ВЫБОР
		|		КОГДА ЗарплатаКВыплатеЗарплата.Авторасчет
		|			ТОГДА АвансыРаботникам.СуммаАванса
		|		ИНАЧЕ ЗарплатаКВыплатеЗарплата.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ЗарплатаКВыплатеЗарплата.Авторасчет
		|ИЗ
		|	Документ.ЗарплатаКВыплате.Зарплата КАК ЗарплатаКВыплатеЗарплата
		|		ЛЕВОЕ ВНЕШНЕЕ СОЕДИНЕНИЕ РегистрСведений.АвансыРаботникам КАК АвансыРаботникам
		|		ПО ЗарплатаКВыплатеЗарплата.Физлицо = АвансыРаботникам.Физлицо
		|ГДЕ
		|	ЗарплатаКВыплатеЗарплата.Ссылка = &парамСсылка И 
		|	ВЫБОР
		|		КОГДА ЗарплатаКВыплатеЗарплата.Авторасчет
		|			ТОГДА АвансыРаботникам.СуммаАванса ЕСТЬ НЕ NULL 
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	ИначеЕсли ХарактерВыплаты = Перечисления.ХарактерВыплатыЗарплаты.Зарплата Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗарплатаКВыплатеЗарплата.НомерСтроки,
		|	ЗарплатаКВыплатеЗарплата.Физлицо,
		|	ВЫБОР
		|		КОГДА ЗарплатаКВыплатеЗарплата.Авторасчет
		|			ТОГДА ВзаиморасчетыСРаботникамиОстатки.СуммаУпрОстаток
		|		ИНАЧЕ ЗарплатаКВыплатеЗарплата.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ЗарплатаКВыплатеЗарплата.Авторасчет
		|ИЗ
		|	Документ.ЗарплатаКВыплате.Зарплата КАК ЗарплатаКВыплатеЗарплата
		|		ЛЕВОЕ ВНЕШНЕЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСРаботниками.Остатки(
		|		&парамДата,
		|		    Физлицо В
		|		        (ВЫБРАТЬ
		|		            ЗарплатаКВыплатеЗарплата.Физлицо
		|		        ИЗ
		|		            Документ.ЗарплатаКВыплате.Зарплата КАК ЗарплатаКВыплатеЗарплата
		|		        ГДЕ
		|		            ЗарплатаКВыплатеЗарплата.Ссылка = &парамСсылка)) КАК ВзаиморасчетыСРаботникамиОстатки
		|		ПО ЗарплатаКВыплатеЗарплата.Физлицо = ВзаиморасчетыСРаботникамиОстатки.Физлицо
		|ГДЕ
		|	ЗарплатаКВыплатеЗарплата.Ссылка = &парамСсылка И
		|	ВЫБОР
		|		КОГДА ЗарплатаКВыплатеЗарплата.Авторасчет
		|			ТОГДА ВзаиморасчетыСРаботникамиОстатки.СуммаУпрОстаток ЕСТЬ НЕ NULL 
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ	
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗарплатаКВыплатеЗарплата.НомерСтроки";
				
		Зарплата.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
		

КонецПроцедуры

#Если Клиент Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "Печать" Тогда
	
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗарплатаКВыплате_Печать";
		
		// получаем данные для печати
		Выборка = СформироватьЗапросДляПечати().Выбрать();
		
		// получаем макет
		Макет = ПолучитьМакет("Макет");
		
		// выводим шапку документа
		ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка"); 
		ОбластьМакетаШапка.Параметры.НачалоМесяца  = НачалоМесяца(Ссылка.Дата);
		ОбластьМакетаШапка.Параметры.ДатаДокумента = Ссылка.Дата;
		ТабДокумент.Вывести(ОбластьМакетаШапка);
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаРаботника"); // строка работника
		
		// выводим данные
		Пока Выборка.Следующий() Цикл
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
		
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер,ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект,"Зарплата к выплате "));
	
КонецФункции // Печать

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Печать","Взаиморасчеты с работниками");

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(Зарплата,, "Физлицо");
КонецПроцедуры
